############################################################ 
# p.111, 7.3.3 각종 난수 만들기 
############################################################ 

############################################################ 
# 1. 동전 던지기 난수 생성 
############################################################ 

coin <- function() { 
    x <- runif(1) 
    if (x <= 1/2)    men <- 1 
    else             men <- 0 
    return(men) 
} 

coin() 

############################################################ 
# 2. 가위 바위 보 난수 생성 
############################################################ 

gawibawibo <- function() { 
    x <- runif(1) 
    if       ( x <= 1/3)   te <- 1 
    else if  ( x <= 2/3)   te <- 2 
    else                   te <- 3 
    return(te) 
} 

gawibawibo() 


############################################################ 
# p.112, 7장 연습문제(1) 
############################################################ 

############################################################ 
# 1. 주사위 눈의 난수 생성 
############################################################ 

dice <- function() { 
    x <- runif(1) 
    if       ( x <= 1/6)   dot <- 1 
    else if  ( x <= 2/6)   dot <- 2 
    else if  ( x <= 3/6)   dot <- 3 
    else if  ( x <= 4/6)   dot <- 4 
    else if  ( x <= 5/6)   dot <- 5 
    else                   dot <- 6 

    return(dot) 
} 

dice() 

############################################################ 
# 2. 날씨의 난수 생성 
############################################################ 

weather <- function() { 
    x <- runif(1) 
    if       ( x <= 0.7)   temp <- "Sunny" 
    else if  ( x <= 0.9)   temp <- "Cloudy" 
    else                   temp <- "Rainy" 
    return(temp) 
} 

weather() 
 

############################################################ 
# p.113, 7.4 한 번의 시뮬레이션(준비 2) 
############################################################ 
 

############################################################ 
# 1. 한 번의 시뮬레시연을 위한 프로그램 Prototype 
############################################################ 

mysim <- function() { 
    count <- 0 

    return(count) 
} 

############################################################ 
# 2. 동전 1개를 10회 던졌을 때 앞면이 몇번 나오는가? 
############################################################ 

coin <- function() { 
        x <- runif(1) 
        if (x <= 1/2)   men <- 1 
        else            men <- 0 
        return(men) 
} 

  

#---------------- 

mycointoss1 <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
            x <- coin() 
        if (x==1) count <- count + 1 
    } 
    return(count) 
} 

mycointoss(10) 

#---------------- 

#---------------- 

# mycointoss1() 보다 mycointoss2()가 훨씬 간겷함 ==> "프로그램의 최적화" 

mycointoss2 <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
           count <- count + coin() 
    } 
    return(count) 
} 
 
mycointoss2(10) 


############################################################ 
# p.115, 7장 연습문제(2) 
############################################################ 
 

############################################################ 
# 1. 주사위 한 개를 10회 던졌을 때 1이 몇번 나오는지 시뮬레이션하느 함수 정의 
############################################################ 


mydicetoss <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
        x <- runif(1) 
        if            ( x <= 1/6)   dot <- 1 
        else if       ( x <= 2/6)   dot <- 2 
        else if       ( x <= 3/6)   dot <- 3 
        else if       ( x <= 4/6)   dot <- 4 
        else if       ( x <= 5/6)   dot <- 5 
        else                        dot <- 6 
        if (dot==1) count <- count + 1 
    } 
    return(count) 
} 

mydicetoss(10) 
 

############################################################ 
# 2. 날씨가 맑을 확률 70%, 흐릴 확률 20%, 비올 확률 10$ 
#    어떤 달(30일)의 날씨 관측시, 맑은 날이 며칠인지 출력하는 함수 
############################################################ 

myweather <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
        x <- runif(1) 
        if            ( x <= 7/10)   temp <- 1 
        else if       ( x <= 9/10)   temp <- 2 
        else                         temp <- 3 
        if (temp==1) count <- count + 1 
    } 
    return(count) 
} 

myweather(30) 

############################################################ 
# 3. 주사위 한 개를 10회 던졌을 때, 눈이 나오는 전체적인 모양 
############################################################ 

mydicetoss2 <- function(n) { 
    dice <- c() 
    for (i in 1:n) { 
        x <- runif(1) 
        if       ( x <= 1/6)    dice <- c(dice,1) 
        else if  ( x <= 2/6)    dice <- c(dice,2) 
        else if  ( x <= 3/6)    dice <- c(dice,3) 
        else if  ( x <= 4/6)    dice <- c(dice,4) 
        else if  ( x <= 5/6)    dice <- c(dice,5) 
            else                    dice <- c(dice,6) 
    } 
    return(dice) 
} 

mydicetoss2(30) 
  

############################################################ 
# 4. 날씨가 맑을 확률 70%, 흐릴 확률 20%, 비올 확률 10$ 
#    어떤 달(30일)의 날씨 관측시, 맑은 날이 며칠인지 출력하는 함수 
############################################################ 

myweather <- function(n) { 
    weather <- c() 
    for (i in 1:n) { 
        x <- runif(1) 
        if            ( x <= 7/10)   weather <- c(weather, "Sunny") 
        else if       ( x <= 9/10)   weather <- c(weather, "Cloudy") 
        else                         weather <- c(weather, "Rainy") 
    } 
    return(weather) 
} 

myweather(30) 


############################################################ 
# p.117, 7.5 몬테카를로 시뮬레이션 
############################################################ 

############################################################ 
# 1. Function Prototype 
############################################################ 

mymontecarlo <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
                        # 시뮬레이션 순서를 기술 
                        # 시뮬레이션 n번 실행 
                        # 실행결과를 count에 더한다. 
    } 
    return(count/n) 
} 


############################################################ 
# 2. 동전을 한번 던지는 함수 coin()를 이용한 몬테카를로 시뮬레이션 
############################################################ 

coin <- function() { 
        x <- runif(1) 
        if (x <= 1/2)   men <- 1 
        else            men <- 0 
        return(men) 
} 

my_mc_coin <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
          count <- count + coin() 
    } 
    return(count/n) 
} 

my_mc_coin(10000) 

  

############################################################ 
# 3. 주사위 한 개를 10회 던졌을 때, 눈이 나오는 전체적인 모양 
############################################################ 

mydicetoss2 <- function(n) { 
    dice <- c() 
    for (i in 1:n) { 
        x <- runif(1) 
        if       ( x <= 1/6)    dice <- c(dice,1) 
        else if  ( x <= 2/6)    dice <- c(dice,2) 
        else if  ( x <= 3/6)    dice <- c(dice,3) 
        else if  ( x <= 4/6)    dice <- c(dice,4) 
        else if  ( x <= 5/6)    dice <- c(dice,5) 
            else                    dice <- c(dice,6) 
    } 
    return(dice) 
} 

mydicetoss2(30) 


############################################################ 
# 4. 날씨가 맑을 확률 70%, 흐릴 확률 20%, 비올 확률 10$ 
#    어떤 달(30일)의 날씨 관측시, 맑은 날이 며칠인지 출력하는 함수 
############################################################ 

myweather <- function(n) { 
    weather <- c() 
    for (i in 1:n) { 
        x <- runif(1) 
        if            ( x <= 7/10)   weather <- c(weather, "Sunny") 
        else if       ( x <= 9/10)   weather <- c(weather, "Cloudy") 
        else                         weather <- c(weather, "Rainy") 
    } 
    return(weather) 
} 

myweather(30) 


############################################################ 
# p.119, 7.5.1. 확률적인 문제에 대한 시뮬레이션 
############################################################ 

coin.montecarlo <- function(n) { 
       count <- 0 
       for (i in 1:n) { 
           count <- count + mycointoss2(10) 
       } 
       return(count/n) 
} 

coin.montecarlo(1000) 
coin.montecarlo(10000) 
coin.montecarlo(100000) 
 

############################################################################# 
# p.120, 7장 연습문제(3) 
############################################################################# 

############################################################################# 
# 1. 맑을 확률 70%, 흐릴 확률 20%, 그리고 비올 확률 10% 
# 일주일 내내 비가 오지 않을 때는 1, 그렇지 않으면 0을 출력하는 함수 weather.week() 정의 
############################################################################# 

weather.week <- function() { 
           count <- 0 
           for (i in 1:7) { 
               if (runif(1) <= 1/10)  count <- count + 1 
           } 
           if (count == 0) return (1) 
           else return(0) 
} 

weather.week() 


##################################################################### 
# 2. weather.week()를 이용하여, 52회 반복하는 weather.montecarlo() 함수를 정의하라. 
##################################################################### 

weather.montecarlo <- function(n) { 

          count <- 0 
          for (i in 1:n)  
              count <- count + weather.week() 
           
          return(count) 
} 

weather.montecarlo(52)  
 

############################################################ 
# p.122, 7.5.2 비확률적인 문제인 대한 시뮬레이션 
############################################################ 
  

############################################################ 
# 1. Function Prototype 
############################################################ 

mymontecarlo <- function(n) { 
    count <- 0 
    for (i in 1:n) { 
                        # 시뮬레이션 순서를 기술 
                        # 시뮬레이션 n번 실행 
                        # 실행결과를 count에 더한다. 
    } 
    return(count/n) 
} 

############################################################ 
# 2. 원주율 구하기 
# 반지름이 1인 원을 1/4 크기만큼 잘라낸 면적 = 원주율/4 
############################################################ 

pi.montecarlo <- function(n) { 
        count <- 0 
        for (i in 1:n) { 
            suna <- runif(2) 
            if (sqrt(suna[1]^2 + suna[2]^2) < 1)  
                count <- count + 1 
        } 
        return(4*count/n) 
} 

pi.montecarlo(10000) 

  

############################################################ 

# 3. 원의 넓이 구하기 

# 반지름이 1인 원을 1/4 크기만큼 잘라낸 면적 = 원주율/4 

############################################################ 

  

pi.montecarlo2 <- function(n) { 

        count <- 0 

        for (i in 1:n) { 

            suna <- runif(2, min=-1, max=1) 

            if (sqrt(suna[1]^2 + suna[2]^2) < 1)  

                count <- count + 1 

        } 

        return(4*count/n) 

} 

  

pi.montecarlo2(10000) 

pi.montecarlo2(50000) 

  

 

 

############################################################ 

# p.126, 7정 연습문제(4) 

############################################################ 

  

############################################################ 

# 1. 한 변의 길이가 1인 정사각형 안에 

#    1) 중심이 (0.3, 0.3)이고 반지름이 0.3인 원 

#    2) 중심이 (0.6, 0.6)이고 반지름이 0.4인 원 

#    이 붙어 있는 원형의 면적을 구하는 함수 

############################################################ 

  

circle.montecarlo <- function(n) { 

    count <- 0 

    for (i in 1:n) { 

            suna <- runif(2) 

            if ((sqrt((suna[1]-0.3)^2 + (suna[2]-0.3)^2) < 0.3) || (sqrt((suna[1]-0.6)^2 + (suna[2]-0.6)^2) < 0.4))  

                count <- count + 1 

        } 

      return(count/n) 

} 

  

circle.montecarlo(10000) 

  

############################################################ 

# 2. f(x) = exp(-x^2)을 0부터 1까지 적분하는 몬테카를로 시뮬레이션 

############################################################ 

  

exp.montecarlo <- function(n) { 

        count <- 0 

        for (i in 1:n) { 

            suna <- runif(2) 

            f <- exp(-suna[1]^2) 

            if ( suna[2] < f)  

                count <- count + 1 

        } 

        return(1*count/n) 

} 

  

exp.montecarlo(10000)                # 사각형의 면적이 1 

  

  

############################################################ 

# 3. f(x) = exp(-x^2)을 -1부터 1까지 적분하는 몬테카를로 시뮬레이션 

############################################################ 

  

exp.montecarlo2 <- function(n) { 

        count <- 0 

        for (i in 1:n) { 

            sunax <- runif(1, min=-1, max=1) 

            sunay <- runif(1) 

            f <- exp(-sunax^2) 

            if ( sunay < f)  

                count <- count + 1 

        } 

        return(2*count/n)                # 사각형의 면적이 2 

} 

  

exp.montecarlo2(10000) 

 

 

############################################################ 

# p.127, 7.6 보충학습 

############################################################ 

  

############################################################ 

# 7.6.1 복잡한 도형의 체적 

#    길이 1인 정육면체 안에  

#    1) '중심이 (0.3, 0.3, 0.7)이고, 반지름이 0.3인 구, 

#    2) '중심이 (0.5, 0.5, 0.5)이고, 반지름이 0.4인 구, 

#    3) '중심이 (0.7, 0.7, 0.7)이고, 반지름이 0.3인 구 

#    가 붙어 있는 도형의 체적을 구하는 함수 

############################################################ 

  

ball.montecarlo <- function(n) { 

    count <- 0 

    for (i in 1:n) { 

            suna <- runif(3) 

            if ( ( (suna[1]-0.3)^2 + (suna[2]-0.3)^2 + (suna[3]-0.7)^2 ) < 0.3^2  

               || ( (suna[1]-0.5)^2 + (suna[2]-0.5)^2 + (suna[3]-0.5)^2 ) < 0.4^2  

               || ( (suna[1]-0.7)^2 + (suna[2]-0.7)^2 + (suna[3]-0.7)^2 ) < 0.3^2 )  

               count <- count + 1 

        } 

      return(count/n) 

} 

  

ball.montecarlo(10000) 

  

############################################################ 

# 7.6.2 몬테카를로 시뮬레이션 함수 정의 

############################################################ 

  

############################################################ 

#  몬테카를로 시뮬레이션를 위한 범용성 있는 함수 정의 

############################################################ 

  

mymontecarlo2 <- function(n,k,fun) { 

        count <- 0 

        for (i in 1:n) { 

  

                count <- count + fun(k) 

        } 

        return(count/n) 

} 

  

# mymontecarlo2(시뮬레이션 횟수, 함수의 인수, 함수) 

# 예, mymontecarlo2(10000, 10, mycointoss) 

  

  

############################################################ 

# 7.6.3 확률분포를 따르는 난수를 이용한 시뮬레이션 

############################################################ 

  

rbinom(1,1,0.5)            # 동전을 1번 던져 앞면이 나오면 1, 뒷면이 나오면 0 

sum(rbinom(10, 1, 0.5))    # 동전을 10번 던졌을 때의 앞면이 나온 횟수의 합. 

  

mymontecarlo2(10000, 1, runif) 

mymontecarlo2(10000, 1, rexp) 

mymontecarlo2(10000, 1, runif) 

 